package com.example.navid.androidproject.Other;

public class CategoryEnum {

    public static String relation = "{\"1\":[\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\"],\"2\":[\"8\",\"9\",\"10\",\"11\",\"12\",\"13\",\"14\"],\"3\":[\"15\",\"16\",\"17\",\"18\",\"19\",\"20\",\"21\"],\"4\":[\"22\",\"23\",\"24\",\"25\",\"26\",\"27\",\"28\",\"29\",\"30\"],\"5\":[\"31\",\"32\",\"33\",\"34\",\"35\",\"36\"],\"6\":[\"37\",\"38\",\"39\",\"40\"],\"7\":[\"41\",\"42\"],\"8\":[\"43\",\"44\",\"45\",\"46\",\"47\",\"48\"]}";

    public static String[] SubCategory = {
        "بی\u200Cنام",
        "موبایل و تبلت",
        "کامپیوتر و لپ تاپ",
        "لوازم جانبی",
        "دوربین",
        "تلویزیون و سیستم صوتی",
        "تجهیزات الکترونیک",
        "کنسولهای بازی",
        "لباس بچه گانه",
        "لباس زنانه",
        "لباس مردانه",
        "کیف و کفش",
        "اکسسوری زنانه",
        "اکسسوری مردانه",
        "چمدان و کیف مسافرتی",
        "لوازم برقی خانه",
        "لوازم برقی آشپزخانه",
        "نظافت و گردگیری منزل",
        "نظافت و گردگیری منزل",
        "آشپزخانه",
        "لوازم عمومی منزل",
        "دکوراسین داخلی منزل",
        "موی سر",
        "اصلاح سر،صورت و بدن",
        "سلامتی و تندرستی",
        "آرایشی",
        "مراقبت از پوست",
        "مراقبت نوزاد و کودک",
        "عطر",
        "دست، پا و ناخن",
        "بهداشت دهان و دندان",
        "اسباب بازی و سرگرمی",
        "لوازم انواع ورزش ها",
        "لباس ورزشی مردانه",
        "لباس ورزشی مردانه",
        "لباس ورزشی مردانه",
        "کوهنوردی، طبیعت گردی",
        "صنایع دستی",
        "لوازم تحریر",
        "چندرسانه ای",
        "کتاب",
        "ابزارآلات",
        "لوازم خودرو",
        "نوشیدنی",
        "صبحانه و دسر",
        "تنقلات",
        "چاشنی و روغن",
        "غذای خام",
        "غذای نیمه آماده و آماده"
    };

    public static int getSubCategoryID(String subCategory){
        for(int i = 0 ; i < SubCategory.length ; i++)
            if(SubCategory[i].equals(subCategory))
                return i;
        return -1;
    }
}
